dic = {'Й': 'Q', 'Ц': 'W', 'У': 'E', 'К': 'R', 'Е': 'T ', 'Н': 'Y',
       'Г': 'U', 'Ш': 'I', 'Щ': 'O', 'З': 'P', 'Ф': 'A', 'Ы': 'S', 'В': 'D',
       'А': 'F', 'П': 'G', 'Р': 'H', 'О': 'J', 'Л': 'K', 'Д': 'L',
       'Ж': ';', 'Я': 'Z', 'Ч': 'X', 'С': 'C', 'М': 'V', 'И': 'B', 'Т': 'N', 'Ь': 'M'}


st = ('103300092816761018001ИАТУКЛ3ЙКАЕСП7КЙАЛГШУ5Ш64ГЧТЬСУНЦАЦУОУ2ЬЯ7М6ЬУЫЩЗЛМ4ЛЬСЯЩТКТКМНФ3М3ЛТЦ2ЗЩЦЧТПЫЛП2УЫУ2ЛФ7ЫЬРЙ7ФЕГМДЬЫЩ6ИЬ4ФФВДЬ4НМФЦГЦЩ6ЗГШТАУЫГ4Н')
result = str()

len_st = len(st)
for i in range(0, len_st):
    simb = dic.get(st[i], st[i])
    result = result + simb

print(result)
